{
    "imageQueryLayers": [
        {
            //url: string to catalog image service
            "url": "http://myserver/arcgis/rest/services/LiDARManagement/Lidar_Web4C/ImageServer",
            //label: name of the catalog. this is not currently used
            "label": "Catalog",
            //queryWhereClauseAppend: string to append to all where clauses to the server. ie: dont retrieve overviews in a query
            "queryWhereClauseAppend": "Category = 1"
        }
    ],
    //imageDiscoveryQueryFields: array of json objects that describe fields in the catalog layer that can be queried on in discovery
    "imageDiscoveryQueryFields": [
        {
            //field: field name on the service to query on
            "field": "FieldName",
            //label: label for the field to display to the user
            "label": "DisplayLabel"
        }
    ],
    //imageQueryResultDisplayFields: array of json objects that describe fields in the catalog layer that are displayed in the result grid.
    "imageQueryResultDisplayFields": [
        {
            //field: name of the field on the image service
            "field": "Name",
            //label: the label to display in the result grid header for this field
            "label": "Name",
            //filter: json object with "enabled" member. when enabled is true the field is filterable
            //NOTE: for slider filters you can also specify "unitsLabel". this is a string that will be displayed next to the sliders current value
            "filter": {
                "enable": true

            },
            //style: object that takes in camel case css styles and applies them to the grid field
            "style": {
                "fontWeight": "bold",
                "fontFace": "italic"
            },
            //gridOptions: various options on how to display the grid
            "gridOptions": {
                //hiddenOnDisplay: hide the field on display. field must be activated in ColumnHider widget for display. default is false
                "hiddenOnDisplay": true,
                //canHide: user cannot hid the field in the result grid. default is true.
                "canHide": false
            }
        },
        {
            "field": "AcquisitionDate",
            "label": "AcquisitionDate ",
            "filter": {
                "enable": true
            }
        }
    ],
    //imageQueryResults: json object dscribing how to render/format results
    "resultsFormatting": {
        "displayFormats": {
            //date: string format that will be used across the application
            "date": "dd-MM-yyyy"
        },
        //floatPrecision: number of decimal places to display in results and reporting
        "floatPrecision": 1
    },
    //discoverGeometryUploadTask: object describing the Geoprocessing service that allows the user to upload their own KMZ/SHP files for discovery
    "discoverGeometryUploadTask": {
        //uploadUrl: string to the 10.1+ upload capability of the geoprocessing service. ie: htttp://myserver/MyTools/MyService/uploads/upload
        "uploadUrl": "http://myserver/arcgis/rest/services/KACST/UploadGeometries/GPServer/uploads/upload",
        //geoprocessingTaskUrl: string to the  upload geoprocessing service. ie: htttp://myserver/MyTools/MyService/
        "geoprocessingTaskUrl": "http://myserver/arcgis/rest/services/KACST/UploadGeometries/GPServer/fileToFeatures",
        //uploadSHPFileParameterName: name for the shp file input parameter of the geoprocessing service
        "uploadSHPFileParameterName": "uploadSHPFile",
        //uploadKMLFileParameterName: name for the kml file input parameter of the geoprocessing service
        "uploadKMLFileParameterName": "uploadKMLFile",
        //uploadKMZFileParameterName: name for the kmz file input parameter of the geoprocessing service
        "uploadKMZFileParameterName": "uploadKMZFile",
        //spatialReferenceWKIDParameterName: the parameter we will pass the WKID to. this is normally exposed by ArcGIS Server as "env:outSR"
        "spatialReferenceWKIDParameterName": "env:outSR",
        //outputFeaturesParameterName: the putput parameter name that will contain our upload output features
        "outputFeaturesParameterName": "outFeatures",
        //isAsync: true will invoke the geoprocessing service asynchronous
        "isAsync": true
    },
    "searchConfiguration": {
    },
    "exportConfiguration": {
        //image: contains a height and width that is used for export image download capability
        "image": {
            "height": 800,
            "width": 600
        },
        //points to footprints export task
        "footprints": {
            "task": {
                //url - URL to the reporting tool
                "url": "http://myserver/arcgis/rest/services/KACST/reportGenerator/GPServer/Report%20Generator",
                //featureInputParameter - input parameter for the generator tool
                "featureInputParameter": "Input_JSON_String",
                //outputUrlParameter - output parameter containing the response
                "outputUrlParameter": "Report_URL",
                "isAsync": true

            }
        }
    },
    //utmLookup: json object containing "url" parameter that points to the UTM lookup object used the the discovery widgets UTM inner widget
    "utmLookup": {
        "url": "config/data/utm/UTMWKIDLookup.json"
    },
    //reporting: "html" child points to the template for the html reporting tool
    "reporting": {
        "html": {
            "templateURL": "templates/htmlReport.html"
        }
    }
}