{
    //layerTransparency position of the layer transparency window
    "layerTransparency": {
        "x": 745,
        "y": 10
    },
    //draw: position of the draw window
    "draw": {
        "x": 425,
        "y": 10
    },
    //time: position of the base viewer time slider window
    "time": {
        "x": 10,
        "y": 50
    },
    //accordion: position of the tools accordion. NOTE: accordion needs to be populated through code
    "accordion": {
        "x": 70,
        "y": 20
    },
    //throbber: position of the global activity indicator
    "throbber": {
        "x": 380,
        "y": 5
    },
    //messaging: position of the messaging widget that displays quick information on user actions
    "messaging": {
        "x": 520,
        "y": 5
    },
    //navigation: position of the navigation text widget. this widget is auto aligned to the left
    "navigation": {
        "y": 0
    },
    //download: position of the window containing download widgets. ie: feature download and image download
    "download": {
        "y": 400,
        "x": 20
    },
    //downloadItems: position of the download prompt window. This window lists the files that are available for download
    "downloadItems": {
        "y": 200,
        "x": 450
    },
    //featureEdit: feature editor widget windwo positioning
    "featureEdit": {
        "x": 610,
        "y": 50
    },
    //imageryTime: imagery viewer time slider window for results. NOTE: not used in base viewer
    "imageryTime": {
        "x": 745,
        "y": 200
    },
    //imageInfo: position of the image info widget that displays a results fields and thumbnail
    "imageInfo": {
        "x": 300,
        "y": 100
    },
    //queryBuilder: position of the query builder widget NOTE: not fully implemented
    "queryBuilder": {
        "x": 10,
        "y": 10
    },
    //measure: position of the measure widget
    "measure": {
        "x": 380,
        "y": 125
    },
    //identify: position of the identify widget
    "identify": {
        "x": 425,
        "y": 175
    },
    //reverseGeocode: position of the reverse geocode widget
    "reverseGeocode": {
        "x": 600,
        "y": 150
    },
    //zoomToUserLocation: position of zoom to user location widget
    "zoomToUserLocation": {
        "x": 20,
        "y": 205
    },
    //print: position of zoom to print window widget
    "print": {
        "x": 350,
        "y": 100
    },
    //socialMedia: position of zoom to social media window widget
    "socialMedia": {
        "x": 450,
        "y": 250
    },
    //weather: position of zoom to weather window widget
    "weather": {
        "x": 450,
        "y": 450
    },
    //reflectance: position of zoom to reflectance window widget
    "reflectance": {
        "x": 450,
        "y": 650
    },
    //zoomTo: position of zoom to zoom to window widget
    "zoomTo": {
        "x": 650,
        "y": 650
    },
    //portalPublisher: position of zoom to publish to portal window widget
    "portalPublisher": {
        "x": 600,
        "y": 300
    },
    //plotting: position of zoom to plotting coordinates window widget
    "plotting": {
        "x": 500,
        "y": 75
    },
    //logging: position of logging window widget
    "logging": {
        "x": 10,
        "y": 350
    }
}